platformio/platform-ststm32/misc/svd/STM32L496.svd
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>Interrupt and Status register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ADDCODE</name>
                     <description>Address match code (Slave               mode)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer direction (Slave               mode)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Bus busy</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ALERT</name>
                     <description>SMBus alert</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Timeout or t_low detection               flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PECERR</name>
                     <description>PEC Error in reception</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>Overrun/Underrun (slave               mode)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ARLO</name>
                     <description>Arbitration lost</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BERR</name>
                     <description>Bus error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TCR</name>
                     <description>Transfer Complete Reload</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>Transfer Complete (master               mode)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STOPF</name>
                     <description>Stop detection flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NACKF</name>
                     <description>Not acknowledge received               flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>Address matched (slave               mode)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXNE</name>
                     <description>Receive data register not empty               (receivers)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXIS</name>
                     <description>Transmit interrupt status               (transmitters)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXE</name>
                     <description>Transmit data register empty               (transmitters)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>Interrupt clear register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ALERTCF</name>
                     <description>Alert flag clear</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMOUTCF</name>
                     <description>Timeout detection flag               clear</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PECCF</name>
                     <description>PEC Error flag clear</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRCF</name>
                     <description>Overrun/Underrun flag               clear</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARLOCF</name>
                     <description>Arbitration lost flag               clear</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BERRCF</name>
                     <description>Bus error flag clear</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOPCF</name>
                     <description>Stop detection flag clear</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACKCF</name>
                     <description>Not Acknowledge flag clear</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADDRCF</name>
                     <description>Address Matched flag clear</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PECR</name>
               <displayName>PECR</displayName>
               <description>PEC register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PEC</name>
                     <description>Packet error checking               register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXDR</name>
               <displayName>RXDR</displayName>
               <description>Receive data register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>8-bit receive data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDR</name>
               <displayName>TXDR</displayName>
               <description>Transmit data register</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>8-bit transmit data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
