platformio/platform-ststm32/misc/svd/STM32L496.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>VREFBUF</name>
         <description>Voltage reference buffer</description>
         <groupName>VREF</groupName>
         <baseAddress>0x40010030</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x1D0</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CSR</name>
               <displayName>CSR</displayName>
               <description>VREF control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ENVR</name>
                     <description>Voltage reference buffer               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HIZ</name>
                     <description>High impedance mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VRS</name>
                     <description>Voltage reference scale</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VRR</name>
                     <description>Voltage reference buffer               ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCR</name>
               <displayName>CCR</displayName>
               <description>calibration control register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>Trimming code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>CAN1</name>
         <description>Controller area network</description>
         <groupName>CAN</groupName>
         <baseAddress>0x40006400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CAN1_TX</name>
            <description>CAN1 TX interrupts</description>
            <value>19</value>
         </interrupt>
         <interrupt>
            <name>CAN1_RX0</name>
            <description>CAN1 RX0 interrupts</description>
            <value>20</value>
         </interrupt>
         <interrupt>
            <name>CAN1_RX1</name>
            <description>CAN1 RX1 interrupts</description>
            <value>21</value>
         </interrupt>
         <interrupt>
            <name>CAN1_SCE</name>
            <description>CAN1 SCE interrupt</description>
            <value>22</value>
         </interrupt>
         <registers>
            <register>
               <name>MCR</name>
               <displayName>MCR</displayName>
               <description>master control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00010002</resetValue>
               <fields>
                  <field>
                     <name>DBF</name>
                     <description>DBF</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RESET</name>
                     <description>RESET</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TTCM</name>
                     <description>TTCM</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOM</name>
                     <description>ABOM</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWUM</name>
                     <description>AWUM</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NART</name>
                     <description>NART</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFLM</name>
                     <description>RFLM</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFP</name>
                     <description>TXFP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLEEP</name>
                     <description>SLEEP</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INRQ</name>
                     <description>INRQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSR</name>
               <displayName>MSR</displayName>
               <description>master status register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000C02</resetValue>
               <fields>
                  <field>
                     <name>RX</name>
                     <description>RX</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SAMP</name>
                     <description>SAMP</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RXM</name>
                     <description>RXM</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXM</name>
                     <description>TXM</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLAKI</name>
                     <description>SLAKI</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WKUI</name>
                     <description>WKUI</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ERRI</name>
                     <description>ERRI</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SLAK</name>
                     <description>SLAK</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INAK</name>
                     <description>INAK</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSR</name>
               <displayName>TSR</displayName>
               <description>transmit status register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x1C000000</resetValue>
               <fields>
                  <field>
                     <name>LOW2</name>
                     <description>Lowest priority flag for mailbox               2</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOW1</name>
                     <description>Lowest priority flag for mailbox               1</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOW0</name>
                     <description>Lowest priority flag for mailbox               0</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TME2</name>
                     <description>Lowest priority flag for mailbox               2</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TME1</name>
                     <description>Lowest priority flag for mailbox               1</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TME0</name>
                     <description>Lowest priority flag for mailbox               0</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CODE</name>
                     <description>CODE</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ABRQ2</name>
                     <description>ABRQ2</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TERR2</name>
                     <description>TERR2</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALST2</name>
                     <description>ALST2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXOK2</name>
                     <description>TXOK2</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RQCP2</name>
                     <description>RQCP2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ABRQ1</name>
                     <description>ABRQ1</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TERR1</name>
                     <description>TERR1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALST1</name>
                     <description>ALST1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXOK1</name>
                     <description>TXOK1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RQCP1</name>
                     <description>RQCP1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ABRQ0</name>
                     <description>ABRQ0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TERR0</name>
                     <description>TERR0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ALST0</name>
                     <description>ALST0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXOK0</name>
                     <description>TXOK0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RQCP0</name>
                     <description>RQCP0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RF0R</name>
               <displayName>RF0R</displayName>
               <description>receive FIFO 0 register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFOM0</name>
                     <description>RFOM0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FOVR0</name>
                     <description>FOVR0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FULL0</name>
                     <description>FULL0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FMP0</name>
                     <description>FMP0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RF1R</name>
               <displayName>RF1R</displayName>
               <description>receive FIFO 1 register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RFOM1</name>
                     <description>RFOM1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FOVR1</name>
                     <description>FOVR1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FULL1</name>
                     <description>FULL1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FMP1</name>
                     <description>FMP1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <displayName>IER</displayName>
               <description>interrupt enable register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SLKIE</name>
                     <description>SLKIE</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUIE</name>
                     <description>WKUIE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>ERRIE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LECIE</name>
                     <description>LECIE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOFIE</name>
                     <description>BOFIE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPVIE</name>
                     <description>EPVIE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EWGIE</name>
                     <description>EWGIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOVIE1</name>
                     <description>FOVIE1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFIE1</name>
                     <description>FFIE1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMPIE1</name>
                     <description>FMPIE1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FOVIE0</name>
                     <description>FOVIE0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FFIE0</name>
                     <description>FFIE0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FMPIE0</name>
                     <description>FMPIE0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TMEIE</name>
                     <description>TMEIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
