platformio/platform-ststm32/misc/svd/STM32L496.svd
            <register>
               <name>BTR4</name>
               <displayName>BTR4</displayName>
               <description>SRAM/NOR-Flash chip-select timing register           4</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ACCMOD</name>
                     <description>ACCMOD</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLAT</name>
                     <description>DATLAT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BUSTURN</name>
                     <description>BUSTURN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAST</name>
                     <description>DATAST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDHLD</name>
                     <description>ADDHLD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADDSET</name>
                     <description>ADDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCR</name>
               <displayName>PCR</displayName>
               <description>PC Card/NAND Flash control register           3</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000018</resetValue>
               <fields>
                  <field>
                     <name>ECCPS</name>
                     <description>ECCPS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TAR</name>
                     <description>TAR</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TCLR</name>
                     <description>TCLR</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ECCEN</name>
                     <description>ECCEN</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWID</name>
                     <description>PWID</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PTYP</name>
                     <description>PTYP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PBKEN</name>
                     <description>PBKEN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWAITEN</name>
                     <description>PWAITEN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>FIFO status and interrupt register           3</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>FEMPT</name>
                     <description>FEMPT</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IFEN</name>
                     <description>IFEN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ILEN</name>
                     <description>ILEN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IREN</name>
                     <description>IREN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IFS</name>
                     <description>IFS</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ILS</name>
                     <description>ILS</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRS</name>
                     <description>IRS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMEM</name>
               <displayName>PMEM</displayName>
               <description>Common memory space timing register           3</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFCFCFCFC</resetValue>
               <fields>
                  <field>
                     <name>MEMHIZx</name>
                     <description>MEMHIZx</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MEMHOLDx</name>
                     <description>MEMHOLDx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MEMWAITx</name>
                     <description>MEMWAITx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MEMSETx</name>
                     <description>MEMSETx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PATT</name>
               <displayName>PATT</displayName>
               <description>Attribute memory space timing register           3</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xFCFCFCFC</resetValue>
               <fields>
                  <field>
                     <name>ATTHIZx</name>
                     <description>ATTHIZx</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ATTHOLDx</name>
                     <description>ATTHOLDx</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ATTWAITx</name>
                     <description>ATTWAITx</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ATTSETx</name>
                     <description>ATTSETx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCR</name>
               <displayName>ECCR</displayName>
               <description>ECC result register 3</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ECCx</name>
                     <description>ECCx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BWTR1</name>
               <displayName>BWTR1</displayName>
               <description>SRAM/NOR-Flash write timing registers           1</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ACCMOD</name>
                     <description>ACCMOD</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLAT</name>
                     <description>DATLAT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAST</name>
                     <description>DATAST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDHLD</name>
                     <description>ADDHLD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADDSET</name>
                     <description>ADDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BWTR2</name>
               <displayName>BWTR2</displayName>
               <description>SRAM/NOR-Flash write timing registers           2</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ACCMOD</name>
                     <description>ACCMOD</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLAT</name>
                     <description>DATLAT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAST</name>
                     <description>DATAST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDHLD</name>
                     <description>ADDHLD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADDSET</name>
                     <description>ADDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BWTR3</name>
               <displayName>BWTR3</displayName>
               <description>SRAM/NOR-Flash write timing registers           3</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ACCMOD</name>
                     <description>ACCMOD</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLAT</name>
                     <description>DATLAT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAST</name>
                     <description>DATAST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDHLD</name>
                     <description>ADDHLD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADDSET</name>
                     <description>ADDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BWTR4</name>
               <displayName>BWTR4</displayName>
               <description>SRAM/NOR-Flash write timing registers           4</description>
               <addressOffset>0x11C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>ACCMOD</name>
                     <description>ACCMOD</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATLAT</name>
                     <description>DATLAT</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CLKDIV</name>
                     <description>CLKDIV</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DATAST</name>
                     <description>DATAST</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDHLD</name>
                     <description>ADDHLD</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADDSET</name>
                     <description>ADDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
